"""
В большой текстовой строке подсчитать количество встречаемых слов и вернуть 10 самых частых.
Не учитывать знаки препинания и регистр символов. За основу возьмите любую статью из википедии
или из документации к языку.

"""
from collections import Counter
import re

text = """И И И Начало войны было успешным для Антигона. Он смог захватить Сирию, Финикию, Карию и Грецию.
Переломным для хода войны стала битва при Газе, во время которой Птолемей разбил войско Антигона под
командованием его сына Деметрия. Победа при Газе открыла врагам Антигона путь вглубь его азиатских владений.
Селевк, воспользовавшись моментом, решил вернуть себе власть в Вавилоне. Птолемей выделил военачальнику
тысячу воинов и 200 всадников, с которыми Селевк и отправился в Вавилонию. Впоследствии Селевк смог не
только вернуть себе власть в регионе, но и создал на территории владений Антигона государство Селевкидов."""

lower_text = text.lower()
rating_list = Counter(x for x in re.findall(r'[А-я\']{1,}', lower_text))
print(rating_list.most_common(10))
